<?php
// +----------------------------------------------------------------------
// | 接口文件
// +----------------------------------------------------------------------
// | 版权所有 2017~2019 江西快鱼科技有限公司 [ http://www.p2cn.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://p2cn.com
// +----------------------------------------------------------------------
// | 创建者    allenlinc
// +----------------------------------------------------------------------
// | 创建时间  2018-05-21
// +----------------------------------------------------------------------
namespace app\shop\home;
use app\common\controller\Api;
//use app\member\model\User;
//use app\admin\model\Attachment;

/**
 * 充值接口
 * @package app\member\home
 */
class ApiPay extends Api {
    //充值
    public function charge(){
        $input = input('post.');        
        //生成签名        
        plugin_action('Pay/Admin/PayAPP',['type'=>$input['type'],'order'=>$input]);
       
    }
}
