<?php
// +----------------------------------------------------------------------
// | 短信插件
// +----------------------------------------------------------------------
// | 版权所有 2017~2019 江西快鱼科技有限公司 [ http://www.p2cn.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://p2cn.com
// +----------------------------------------------------------------------
// | 创建者    allenlinc（allenlinc@gmail.com）
// +----------------------------------------------------------------------
// | 创建时间  2018/5/23 下午10:09
// +----------------------------------------------------------------------
/**
 * 插件配置信息
 */
return [
    ['group',
        [
            '支付宝' => [
                ['radio', 'zfbStatus', '是否启用', '', [true => '开启', false => '关闭'], true],
                ['radio', 'zfbSandbox', '是否沙箱模式', '是否使用沙盒模式', ['1' => '开启', '0' => '关闭'], 0],
                ['text', 'zfbAppid', 'APPID', ''],
                ['textarea', 'zfbpsn', '支付宝私钥', '注意：如果是文件方式，文件中只保留字符串，不要留下 -----BEGIN RSA PRIVATE KEY----- 这种标记。可以填写文件路径，或者密钥字符串  我的沙箱模式，rsa与rsa2的私钥相同，为了方便测试'],
                ['textarea', 'zfbRAS', '支付宝公钥', '可以填写文件路径，或者密钥字符串  当前字符串是 rsa2 的支付宝公钥(开放平台获取)'],
                ['textarea','zfbLimitpay','限制支付','用户不可用指定渠道支付当有多个渠道时用“,”分隔.格式:\'balance\',// 余额  //\'debitCardExpress\',// 	借记卡快捷'],
                ['text','zfbnotify','异步接口','异步接口的网址 http://或者https://','http://'],
                ['text','zfbredirect','同步接口','如果是h5支付，可以设置该值，返回到指定页面','http://'],
                ['text','zfbexpire','支付过期时间','多少秒内完成支付，否则失效',300]
            ],
            '微信支付' => [
                ['radio', 'wxStatus', '是否启用', '', ['1' => '开启', '0' => '关闭'], 1],
                ['radio', 'wxSandbox', '是否沙箱模式', '是否使用沙盒模式', ['1' => '开启', '0' => '关闭'], 0],
                ['text','wxAppId','app_id','公众账号ID'],
                ['text','wxMchId','mch_id','商户ID'],
                ['text','wxMd5Key','md5_key','md5 秘钥'],
                ['file','wxAppCertPem','app_cert_pem','app_cert_pem文件上传'],
                ['file','wxAppKeyPem','app_key_pem','app_key_pem文件上传'],
                ['textarea','wxLimitPay','限制支付','指定不能使用信用卡支付   不传入，则均可使用'],
                ['text','wxnotify','异步接口','异步接口的网址 http://或者https://','http://'],
                ['text','wxredirect','同步接口','如果是h5支付，可以设置该值，返回到指定页面','http://'],
                ['text','wxexpire','支付过期时间','多少秒内完成支付，否则失效',300]
            ]
        ]
    ]
];